blueprints/infosat/sap/request_xml/sap_invoices_customer_by_date.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
   <soapenv:Header/>
   <soapenv:Body>
      <glob:Z_CustInvoiceQueryByElementsSimpleByRequest_sync>
         <Z_CustInvoiceSimpleSelectionBy>
            <!--Zero or more repetitions:-->
            <SelectionByfacturaFecha>
               <!--Optional:-->
               <InclusionExclusionCode>I</InclusionExclusionCode>
               <IntervalBoundaryTypeCode>3</IntervalBoundaryTypeCode>
               <!--Optional:-->
               <LowerBoundaryfacturaFecha>{{startdate}}</LowerBoundaryfacturaFecha>
               <!--Optional:-->
               <UpperBoundaryfacturaFecha>{{enddate}}</UpperBoundaryfacturaFecha>
            </SelectionByfacturaFecha>
         </Z_CustInvoiceSimpleSelectionBy>
         <ProcessingConditions>
            <!--Optional:-->
            <QueryHitsMaximumNumberValue>10000</QueryHitsMaximumNumberValue>
            <QueryHitsUnlimitedIndicator>false</QueryHitsUnlimitedIndicator>
            <!--Optional:-->
            <LastReturnedObjectID schemeID="?" schemeVersionID="?" schemeAgencyID="?" schemeAgencySchemeID="?" schemeAgencySchemeAgencyID="?">?</LastReturnedObjectID>
         </ProcessingConditions>
      </glob:Z_CustInvoiceQueryByElementsSimpleByRequest_sync>
   </soapenv:Body>
</soapenv:Envelope>